---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Normal
source: html/b496a51b-b3cf-48be-ff32-d779af3514e1.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.Normal Property

The vertex's normal vector.

## Syntax (C#)
```csharp
public XYZ Normal { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null